docs/source/integration/SOAP_API_request_response/archiveDoc_request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://soap.edi.service.org/">
  <soapenv:Header />
  <soapenv:Body>
    <soap:archiveDoc>
      <!-- Optional: -->
      <user>
        <!-- Optional: -->
        <login>login</login>
        <!-- Optional: -->
        <pass>parol</pass>
      </user>
      <!-- Optional: -->
      <fileName>status_2.xml</fileName>
    </soap:archiveDoc>
  </soapenv:Body>
</soapenv:Envelope>